website/app/controllers/api/v1/games_controller.rb

INSERT INTO "games" ("date", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["date", "2018-09-03 00:00:00"], ["created_at", "2018-09-03 14:10:37.350464"], ["updated_at", "2018-09-03 14:10:37.350464"]]
---
      def create
        game = Game.create!(game_params)