website/app/controllers/api/v1/teams_controller.rb

      def index
        render json: Team.all.where(id: [params[:ids]])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" IS NULL