website/app/controllers/api/v1/teams_controller.rb

      def index
        render json: Team.all
---
SELECT "teams".* FROM "teams"

      def show
        team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]