website/app/models/game.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def winner
    Team.find winner_id

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def teams
    Team.where(id: [red_side_team_id, blue_side_team_id])

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def loser
    Team.find loser_id

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def red_side_team
    Team.find red_side_team_id

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def blue_side_team
    Team.find blue_side_team_id

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def first_baron_team
    Team.find first_baron_team_id

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def first_blood_team
    Team.find first_blood_team_id

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def first_turret_team
    Team.find first_turret_team_id

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def first_dragon_team
    Team.find first_dragon_team_id

SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def player_to_get_first(market)
    Player.find(self["first_#{market}_player_id".to_sym])