website/app/controllers/games_controller.rb

SELECT "teams".* FROM "teams"
---
  def new
    @game = Game.new
    @teams_for_select = Team.all.collect {|t| [ t.name, t.id ] }