website/app/controllers/games_controller.rb

SELECT "games".* FROM "games" ORDER BY "games"."date" DESC
---
  def index
    @games = Game.all.order(date: :asc)

INSERT INTO "games" ("first_blood_team_id", "first_turret_team_id", "date", "created_at", "updated_at", "red_side_team_id", "blue_side_team_id", "first_baron_team_id", "first_dragon_team_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    game = Game.create!(game_params)

SELECT "teams".* FROM "teams"
SELECT "players".* FROM "players" INNER JOIN "contracts" ON "players"."id" = "contracts"."player_id" WHERE "contracts"."team_id" = $1  [["team_id", 1]]
---
  def edit
    @players_for_select = @game.teams.first.players.collect {|t| [ t.name, t.id ] }

UPDATE "games" SET "first_turret_team_id" = $1, "first_turret_player_id" = $2, "updated_at" = $3 WHERE "games"."id" = $4  [["first_turret_team_id", 3], ["first_turret_player_id", 2], ["updated_at", "2018-09-06 14:41:25.420409"], ["id", 1]]
---
  def update
    @game.update_attributes(game_params)

SELECT "teams".* FROM "teams"
---
  def set_teams
    @teams_for_select = Team.all.collect {|t| [ t.name, t.id ] }