website/app/controllers/games_controller.rb

  def set_players_for_first
    Game::FIRST_MARKETS.each do |market|
      team_id =  @game["first_#{market}_team_id".to_sym]

      if team_id
        players = Team.find(team_id).players
---
SELECT "games".* FROM "games"
SELECT  "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" IN ($1, $2) ORDER BY "teams"."id" ASC LIMIT $3  [["id", 2], ["id", 1], ["LIMIT", 1]]