website/app/views/games/show.html.erb

SELECT "teams".* FROM "teams"
---
<div>
  First blood (<%= gametime(@game.first_blood_time) %>): <%= @game.first_team_to_get('blood').name %> (<%= @game.player_to_get_first('blood').name %>)